spec/vcr/Errors/should_show_a_charge_given_a_token.yml

---
http_interactions:
- request:
    method: get
    uri: https://<key>:@test-api.pin.net.au/1/charges/ch_0kdOMXP7gG0_W_Vh8qAWdA
    body:
      encoding: US-ASCII
      string: ''
    headers: {}
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - must-revalidate, private, max-age=0
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Mon, 08 Jul 2013 16:02:53 GMT
      Etag:
      - '"b6b7972e6ba347216085e1fa3dfea52a"'
      Server:
      - Apache/2.2.20 (Ubuntu)
      Status:
      - '200'
      Strict-Transport-Security:
      - max-age=31536000
      Vary:
      - User-Agent
      X-Powered-By:
      - Phusion Passenger (mod_rails/mod_rack) 3.0.11
      X-Rack-Cache:
      - miss
      X-Request-Id:
      - 213c399f66edb44536964c687a2dcf00
      X-Runtime:
      - '0.078937'
      X-Ua-Compatible:
      - IE=Edge,chrome=1
      Content-Length:
      - '682'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"response":{"token":"ch_0kdOMXP7gG0_W_Vh8qAWdA","success":true,"amount":190000,"currency":"AUD","description":"mid
        Plan - My Focusbook","email":"hello@myfocusbook.com.au","ip_address":"24.84.102.169","created_at":"2013-03-23T01:30:30Z","status_message":"An
        unexpected error has occurred","error_message":null,"card":{"token":"card_h5nBfXPhwVJH5W0jqwl-pQ","display_number":"XXXX-XXXX-XXXX-0000","scheme":"master","address_line1":"33
        Lyon Street","address_line2":"","address_city":"Melbourne","address_postcode":"3040","address_state":"Victoria","address_country":"Australia"},"transfer":[],"amount_refunded":0,"total_fees":5730,"merchant_entitlement":184270,"refund_pending":false}}'
    http_version: 
  recorded_at: Mon, 08 Jul 2013 16:02:56 GMT
recorded_with: VCR 2.5.0
